added ai skills
